Revit 2027 API
MEPSystem.IsMultipleNetwork Property
 Indicates if the system is well connected or not. The flag will enable the "Divide System" button.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsMultipleNetwork { get; }
Public ReadOnly Property IsMultipleNetwork As Boolean
	Get
public:
property bool IsMultipleNetwork {
	bool get ();
}
member IsMultipleNetwork : bool with get
Property Value
Boolean
See Also
Reference
MEPSystem Class
Autodesk.Revit.DB Namespace